Revit 2026 API

# BuiltInFailuresStructuralConnectionFailures Class

---

Failures about StructuralConnectionHandler.

SystemObject Autodesk.Revit.DBBuiltInFailuresStructuralConnectionFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class StructuralConnectionFailures
```
```vb
Public NotInheritable Class StructuralConnectionFailures
```
```cpp
public ref class StructuralConnectionFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type StructuralConnectionFailures = class end
```

The BuiltInFailuresStructuralConnectionFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | StructuralConnectionCannotGenerate | Could not create Structural Connection Handler |
|  | StructuralConnectionCannotReplaceRefs | Structural Connection cannot replace elements |
|  | StructuralConnectionForbiddenElementInGroup | Fabrication element can not be a group member. |
|  | StructuralConnectionNoSingleRef | Summary: Structural Connection Handler lost connected element. |
|  | StructuralConnectionNotEnoughRefs | Structural Connection Handler cannot connect fewer than two elements. |
|  | StructuralConnectionSetOfRefsChanged | The set of input elements was changed and the connection has been adjusted. |
|  | StructuralConnectionTooFarNotEnoughRefs | Structural Connection Handler cannot connect too far elements |
|  | StructuralConnectionTooFarRefs | Structural Connection Handler cannot connect too far elements |
|  | StructuralConnectionTypeChangedToGeneric | Structural Connection had an inappropriate type, which has been changed to 'Generic Connection'. |
|  | StructuralConnectionTypeInfoNotAvailable | There is no add-on installed which supports Structural Connection type. |
|  | StructuralConnectionWrongType | Structural Connection has an inappropriate type assigned. |
|  | StructuralSectionHasIncompleteDefinition | Structural Section has incomplete definition |

#### Reference

Autodesk.Revit.DB Namespace